export const required = v => v !== null && v !==undefined && v !== '' || 'وارد کردن این فیلد الزامی است'

export const required_array = v => !!v && !!v.length || 'وارد کردن این فیلد الزامی است'

export const mobile = v => !!v && /09[0-9][0-9]-?[0-9]{3}-?[0-9]{4}$/.test(v) || 'شماره موبایل وارد شده صحیح نیست'

export const email = v => !v || (!!v && /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))/.test(v)) || 'ایمیل وارد شده صحیح نیست'

export const password = v => !v || (!!v && v.length >= 8) || 'کلمه عبور باید حداقل ۸ کاراکتر باشد'


